# para este grafo una posible solución sería:
G= [[  0, 881,   0,   0,  72, 191,   0,   0],
    [  0,   0,  94, 535, 490,  19, 224,   0],
    [357,   0,   0, 259,   0,  65, 287, 456],
    [129,   0,   0,   0,   0,   8,   0, 266],
    [  0,   0, 916,  23,   0, 300,   0, 290],
    [  0,   0,   0,   0,   0,   0,   0,   0],
    [ 63,   0,   0,  44, 178, 627,   0,   0],
    [231,  86,   0,   0,   0, 260, 547,   0]]
#  [0, 1, 4, 2, 3, 7, 6, 5] con score 5722
# no tiene por qué dar la misma solución siempre que el score sea 5722
